import board
import bitop
import piece
import attack
import sfen
import file
import color
import gennocap
import gencap
import gendrop
import genevasion

class nocap:
    def test(self):
        bo = board.board()
        bi = bitop.bitop(bo)
        pc = piece.piece()
        at = attack.attack()
        sf = sfen.sfen(bo, bi)
        co = color.color()
        cls_nocap = gennocap.gennocap(bo, bi, pc, at, co)

        #先手番_歩(1)
        sf.str_sfen = '4k4/9/9/4P4/9/6P2/2P6/9/4K4 b - 1'

        #先手番_歩(2)
        #sf.str_sfen = '4k4/9/9/9/6G2/2S3P2/2P6/9/4K4 b - 1'

        #先手番_歩(3)
        #sf.str_sfen = '4k4/9/9/9/6g2/2s3P2/2P6/9/4K4 b - 1'

        #先手番_銀(1)
        #sf.str_sfen = '4k4/9/9/9/9/4P4/3S5/2g6/4K4 b - 1'

        #先手番_銀(2)
        #sf.str_sfen = '2B1k4/1S7/g8/9/9/9/9/9/4K4 b - 1'

        #先手番_金
        #sf.str_sfen = '4k4/9/1P1S5/2G6/2g6/9/9/9/4K4 b - 1'

        #先手番_と
        #sf.str_sfen = '4k4/9/1P1S5/2+P6/2g6/9/9/9/4K4 b - 1'

        #先手番_玉
        #sf.str_sfen = '4k4/9/9/9/9/9/3n1n3/4K4/3g5 b - 1'

        #先手番_角
        #sf.str_sfen = '4k4/9/9/9/4B4/9/6g2/1s7/4K4 b - 1'

        #先手番_飛
        #sf.str_sfen = '4k4/9/9/9/1p2R1s2/9/4g4/9/4K4 b - 1'

        #先手番_馬
        #sf.str_sfen = '4k4/1n5l1/9/4p4/3p+B4/9/9/1s5g1/4K4 b - 1'

        #先手番_龍
        #sf.str_sfen = '4k4/4s4/9/3p5/1p2+R2s1/5p3/4g4/9/4K4 b - 1'
        
        #先手番_香(1)
        #sf.str_sfen = '4k4/9/9/9/1P7/9/9/9/1L2K4 b - 1'

        #先手番_香(2)
        #sf.str_sfen = '4k4/9/9/9/1p7/9/9/9/1L2K4 b - 1'

        #先手番_香(3)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/9/1L2K4 b - 1'

        #先手番_桂(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/2N6/9/4K4 b - 1'

        #先手番_桂(2)
        #sf.str_sfen = '4k4/9/9/9/1P1g5/9/2N6/9/4K4 b - 1'

        #先手番_桂(3)
        #sf.str_sfen = '4k4/9/9/9/6N2/9/9/9/4K4 b - 1'

        #先手番_桂(4)
        #sf.str_sfen = '4k4/9/9/2N6/9/9/9/9/4K4 b - 1'

        #後手番_歩(1)
        #sf.str_sfen = '4k4/9/6p2/2p6/9/4p4/9/9/4K4 w - 1'

        #後手番_歩(2)
        #sf.str_sfen = '4k4/9/2p6/2s3p2/6g2/9/9/9/4K4 w - 1'

        #後手番_歩(3)
        #sf.str_sfen = '4k4/9/2p6/2S3p2/6G2/9/9/9/4K4 w - 1'

        #後手番_銀(1)
        #sf.str_sfen = '4k4/6G2/5s3/4p4/9/9/9/9/4K4 w - 1'

        #後手番_銀(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/8g/7s1/4K1b2 w - 1'

        #後手番_金
        #sf.str_sfen = '4k4/9/9/9/6G2/6g2/5s1p1/9/4K4 w - 1'

        #後手番_と
        #sf.str_sfen = '4k4/9/9/9/6G2/6+p2/5s1p1/9/4K4 w - 1'

        #後手番_玉
        #sf.str_sfen = '5G3/4k4/3N1N3/9/9/9/9/9/4K4 w - 1'

        #後手番_角
        #sf.str_sfen = '4k4/1S7/6G2/9/4b4/9/9/9/4K4 w - 1'

        #後手番_飛
        #sf.str_sfen = '4k4/9/4G4/9/1P2r1S2/9/9/9/4K4 w - 1'

        #後手番_馬
        #sf.str_sfen = '4k4/1P5L1/9/9/3P+b4/4P4/9/1S5G1/4K4 w - 1'

        #後手番_龍
        #sf.str_sfen = '4k4/9/4G4/3P5/1P2+r2S1/5P3/9/4S4/4K4 w - 1'

        #後手番_香(1)
        #sf.str_sfen = '4k2l1/9/9/9/7p1/9/9/9/4K4 w - 1'

        #後手番_香(2)
        #sf.str_sfen = '4k2l1/9/9/9/7P1/9/9/9/4K4 w - 1'

        #後手番_香(3)
        #sf.str_sfen = '4k2l1/9/9/9/9/9/9/9/4K4 w - 1'

        #後手番_桂(1)
        #sf.str_sfen = '4k4/9/2n6/9/9/9/9/9/4K4 w - 1'

        #後手番_桂(2)
        #sf.str_sfen = '4k4/9/2n6/9/1P1g5/9/9/9/4K4 w - 1'

        #後手番_桂(3)
        #sf.str_sfen = '4k4/9/9/9/6n2/9/9/9/4K4 w - 1'

        #後手番_桂(4)
        #sf.str_sfen = '4k4/9/9/9/9/6n2/9/9/4K4 w - 1'

        sf.parse_fen()
        moves = []
        if bo.color == co.black:
            cls_nocap.b_gen_nocaptures(moves)
        else:
            cls_nocap.w_gen_nocaptures(moves)

class cap:
    def test(self):
        bo = board.board()
        bi = bitop.bitop(bo)
        pc = piece.piece()
        at = attack.attack()
        sf = sfen.sfen(bo, bi)
        co = color.color()
        cls_cap = gencap.gencap(bo, bi, pc, at, co)

        #先手番_歩(1)
        sf.str_sfen = '4k4/9/9/4P4/6s2/2p3P2/2P6/9/4K4 b - 1'

        #先手番_歩(2)
        #sf.str_sfen = '4k4/9/9/9/9/2S3P2/2P6/9/4K4 b - 1'

        #先手番_銀(1)
        #sf.str_sfen = '4k4/9/9/9/2p6/2S6/1P1g5/9/4K4 b - 1'

        #先手番_銀(2)
        #sf.str_sfen = '4k4/9/1p7/2S6/3P5/9/9/9/4K4 b - 1'

        #先手番_銀(3)
        #sf.str_sfen = '4k4/9/6S2/9/9/3S5/9/9/4K4 b - 1'

        #先手番_金(1)
        #sf.str_sfen = '4k4/9/9/3p5/4Gs3/4P4/9/9/4K4 b - 1'

        #先手番_金(2)
        #sf.str_sfen = '4k4/9/9/9/4G4/9/9/9/4K4 b - 1'

        #先手番_と(1)
        #sf.str_sfen = '4k4/9/9/3p5/4+Ps3/4P4/9/9/4K4 b - 1'

        #先手番_と(2)
        #sf.str_sfen = '4k4/9/9/9/4+P4/9/9/9/4K4 b - 1'

        #先手番_玉(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/3p5/4Ks3/4P4 b - 1'

        #先手番_玉(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/4K4/9 b - 1'

        #先手番_角(1)
        #sf.str_sfen = '4k4/9/9/3p5/9/5B3/9/9/4K4 b - 1'

        #先手番_角(2)
        #sf.str_sfen = '4k4/7B1/9/9/4p4/9/9/9/4K4 b - 1'

        #先手番_飛(1)
        #sf.str_sfen = '4k4/5p3/9/9/9/2p2R3/9/9/4K4 b - 1'

        #先手番_飛(2)
        #sf.str_sfen = '4k4/2p4R1/9/9/7p1/9/9/9/4K4 b - 1'

        #先手番_馬
        #sf.str_sfen = '4k4/9/9/3p5/5p3/5+B3/9/3r5/4K4 b - 1'

        #先手番_龍
        #sf.str_sfen = '4k4/5p3/9/9/4p4/2p2+R3/9/9/4K4 b - 1'

        #先手番_香(1)
        #sf.str_sfen = '4k4/9/9/1p7/9/9/9/1L7/4K4 b - 1'

        #先手番_香(2)
        #sf.str_sfen = '4k4/9/1p7/9/9/9/9/1L7/4K4 b - 1'

        #先手番_香(3)
        #sf.str_sfen = '4k4/1p7/9/9/9/9/9/1L7/4K4 b - 1'

        #先手番_桂(1)
        #sf.str_sfen = '4k4/9/9/9/9/2p6/9/1N7/4K4 b - 1'

        #先手番_桂(2)
        #sf.str_sfen = '4k4/9/1p7/9/2N6/9/9/9/4K4 b - 1'

        #先手番_桂(3)
        #sf.str_sfen = '4k4/1p7/9/2N6/9/9/9/9/4K4 b - 1'

        #後手番_歩(1)
        #sf.str_sfen = '4k4/9/2p6/2P3p2/6S2/4p4/9/9/4K4 w - 1'

        #後手番_歩(2)
        #sf.str_sfen = '4k4/9/2p6/2s3p2/9/9/9/9/4K4 w - 1'

        #後手番_銀(1)
        #sf.str_sfen = '4k4/9/5G1p1/6s2/6P2/9/9/9/4K4 w - 1'

        #後手番_銀(2)
        #sf.str_sfen = '4k4/9/9/9/5p3/6s2/7P1/9/4K4 w - 1'

        #後手番_銀(3)
        #sf.str_sfen = '4k4/9/9/3s5/9/9/6s2/9/4K4 w - 1'

        #後手番_金(1)
        #sf.str_sfen = '4k4/9/9/4p4/4gS3/3P5/9/9/4K4 w - 1'

        #後手番_金(2)
        #sf.str_sfen = '4k4/9/9/9/4g4/9/9/9/4K4 w - 1'

        #後手番_と(1)
        #sf.str_sfen = '4k4/9/9/4p4/4+pS3/3P5/9/9/4K4 w - 1'

        #後手番_と(2)
        #sf.str_sfen = '4k4/9/9/9/4+p4/9/9/9/4K4 w - 1'

        #後手番_玉(1)
        #sf.str_sfen = '4p4/3Sk4/5P3/9/9/9/9/9/4K4 w - 1'

        #後手番_玉(2)
        #sf.str_sfen = '9/4k4/9/9/9/9/9/9/4K4 w - 1'

        #後手番_角(1)
        #sf.str_sfen = '4k4/9/9/3b5/9/5P3/9/9/4K4 w - 1'

        #後手番_角(2)
        #sf.str_sfen = '4k4/9/9/9/4P4/9/9/1b7/4K4 w - 1'

        #後手番_飛(1)
        #sf.str_sfen = '4k4/9/9/3r2P2/9/9/9/3P5/4K4 w - 1'

        #後手番_飛(2)
        #sf.str_sfen = '4k4/9/9/9/1P7/9/9/1r4P2/4K4 w - 1'

        #後手番_馬
        #sf.str_sfen = '4k4/5R3/9/3+b5/3P5/5P3/9/9/4K4 w - 1'

        #後手番_龍
        #sf.str_sfen = '4k4/9/9/3+r2P2/4P4/9/9/3P5/4K4 w - 1'

        #後手番_香(1)
        #sf.str_sfen = '4k4/7l1/9/9/9/7P1/9/9/4K4 w - 1'

        #後手番_香(2)
        #sf.str_sfen = '4k4/7l1/9/9/9/9/7P1/9/4K4 w - 1'

        #後手番_香(3)
        #sf.str_sfen = '4k4/7l1/9/9/9/9/9/7P1/4K4 w - 1'

        #後手番_桂(1)
        #sf.str_sfen = '4k4/7n1/9/6P2/9/9/9/9/4K4 w - 1'

        #後手番_桂(2)
        #sf.str_sfen = '4k4/9/9/9/6n2/9/7P1/9/4K4 w - 1'

        #後手番_桂(3)
        #sf.str_sfen = '4k4/9/9/9/9/6n2/9/7P1/4K4 w - 1'

        sf.parse_fen()
        moves = []
        if bo.color == co.black:
            cls_cap.b_gen_captures(moves)
        else:
            cls_cap.w_gen_captures(moves)

class drop:
    def test(self):
        bo = board.board()
        bi = bitop.bitop(bo)
        pc = piece.piece()
        at = attack.attack()
        sf = sfen.sfen(bo, bi)
        co = color.color()
        cls_drop = gendrop.gendrop(bo, bi, pc, at, co)

        #先手番_歩(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/P1P1P1P1P/9/4K4 b P 1'

        #先手番_歩(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/1P1P1P1P1/9/4K4 b P 1'

        #先手番_歩(3)
        #sf.str_sfen = 'k8/2G6/G8/9/9/9/9/9/4K4 b P 1'

        #先手番_歩(4)
        #sf.str_sfen = 'lnsgk1snl/1r4gb1/p1ppppppp/9/9/1p7/PPPPPPP1P/1BG4R1/LNS1KGSNL b P 1'

        #先手番_香
        #sf.str_sfen = 'ln1gk1sn1/1rs3gb1/2pppppp1/9/1p5PL/p8/PPPPPPP2/1BG4R1/LNS1KG1N1 b LPsp 1'

        #先手番_桂
        #sf.str_sfen = 'l2g1gsnl/1r1s1k1b1/pp1pppppp/2p6/3P5/2P6/PP2PPPPP/1B5R1/L1SGKGSNL b Nn 1'

        #先手番_銀
        #sf.str_sfen = 'lr5nl/3g1kg2/p1n1ppsp1/2pp2p1p/1p3P1P1/2P3P2/PPSPP1N1P/2GK1G3/LN5RL b BSbs 1'

        #先手番_金
        #sf.str_sfen = 'lnsgk1snl/1r7/ppppppbpp/6p2/7P1/2P6/PP1PPPP1P/7R1/LNSGKGSNL b Gb 1'

        #先手番_角
        #sf.str_sfen = 'lnsgkg1nl/1r5s1/pppppp1pp/6p2/9/2P4P1/PP1PPPP1P/1S5R1/LN1GKGSNL b Bb 1'

        #先手番_飛
        #sf.str_sfen = 'lns1k1snl/2g3gb1/p1ppppppp/9/9/1P7/P1PPPPP1P/1BG6/LNS1KGSNL b RPrp 1'

        #後手番_歩(1)
        #sf.str_sfen = '4k4/9/p1p1p1p1p/9/9/9/9/9/4K4 w p 1'

        #後手番_歩(2)
        #sf.str_sfen = '4k4/9/1p1p1p1p1/9/9/9/9/9/4K4 w p 1'

        #後手番_歩(3)
        #sf.str_sfen = '4k4/9/9/9/9/9/8g/6g2/8K w p 1'

        #後手番_歩(4)
        sf.str_sfen = 'lnsgk1snl/6gb1/p1ppppppp/1r7/9/2P6/PP1PPPP1P/1BG4R1/LNS1KGSNL w Pp 1'

        #後手番_香
        #sf.str_sfen = '1n1gk1snk/1r4gb1/2ppppppp/9/lp5P1/2P4S1/1P1PPPP1P/1BG4R1/1NS1KG1NL w SPlp 1'

        #後手番_桂
        #sf.str_sfen = 'l2gkgsnl/1rs4b1/pp1pppppp/2p6/3P5/2P6/PP2PPPPP/1B5R1/L1SGKGSNL w Nn 1'

        #後手番_銀
        #sf.str_sfen = 'lr5nl/3g1kg2/p1n1ppsp1/2pp2p1p/1p3P1P1/2P3P1P/PPSPP1N2/2GK1G3/LN5RL w BSbs 1'

        #後手番_金
        #sf.str_sfen = 'lnsgk1snl/1r4g2/pppppp1pp/6p2/9/2P6/PPBPPPPPP/7R1/LNS1KGSNL w Gb 1'

        #後手番_角
        #sf.str_sfen = 'lnsgkg1nl/1r5s1/pppppp1pp/6p2/7P1/2P6/PP1PPPP1P/1S5R1/LN1GKGSNL w Bb 1'

        #後手番_飛
        #sf.str_sfen = 'lnsgk1snl/6gb1/p1ppppppp/9/9/1P7/P1PPPPP1P/1BG6/LNS1KGSNL w RPrp 1'

        sf.parse_fen()
        moves = []
        if bo.color == co.black:
            cls_drop.b_gen_drop(moves)
        else:
            cls_drop.w_gen_drop(moves)

class evasion:
    def test(self):
        bo = board.board()
        bi = bitop.bitop(bo)
        pc = piece.piece()
        at = attack.attack()
        sf = sfen.sfen(bo, bi)
        co = color.color()
        cls_evasion = genevasion.genevasion(bo, bi, pc, at, co)

        #先手番_玉が逃げる手
        sf.str_sfen = '4k4/9/9/9/4r4/9/3P1P3/4Ks3/3S5 b - 1'

        #先手番_玉で取る手
        #sf.str_sfen = '4k4/9/9/9/9/9/9/3+pPP3/3NKS3 b - 1'

        #先手番_両王手の場合(1)
        #sf.str_sfen = '4k4/9/9/9/4r4/9/9/3s1P3/4KN3 b - 1'

        #先手番_両王手の場合(2)
        #sf.str_sfen = '4k4/9/9/9/4r4/9/2b6/5P3/3NK4 b - 1'

        #先手番_歩で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/2b6/2P6/4K4 b - 1'

        #先手番_歩で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/3P5/4K4 b - 1'

        #先手番_歩で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/9/2bn5/3P5/4K4 b - 1'

        #先手番_歩で駒を取る場合(4)
        #sf.str_sfen = '4k4/9/8n/8P/7K1/9/9/9/9 b - 1'

        #先手番_歩で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/1r3K3/3P5 b - 1'

        #先手番_歩で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/1r2K4/3P5/9 b - 1'

        #先手番_歩で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/9/1r2K4/3P5/2b6 b - 1'

        #先手番_歩で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/9/1b7/9/2P6/4K4/9/9 b - 1'

        #先手番_歩で利きを遮る場合(5)
        #sf.str_sfen = '4k4/9/9/1b7/9/9/3PK4/9/9 b - 1'

        #先手番_歩で利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/9/1b7/9/9/1r1PK4/9/9 b - 1'

        #先手番_歩で利きを遮る場合(7)
        #sf.str_sfen = 'kr6K/5P3/9/9/9/9/9/9/9 b - 1'

        #先手番_香で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/1b7/9/1L7/4K4 b - 1'

        #先手番_香で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/1b7/9/9/1L2K4 b - 1'

        #先手番_香で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/1b7/9/9/rL2K4 b - 1'

        #先手番_香で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/1r2K4/9/9/2L6 b - 1'

        #先手番_香で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/1r2K4/9/2L6/9 b - 1'

        #先手番_香で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/1r2K4/9/2L6/1b7 b - 1'

        #先手番_香で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/1b7/9/9/4K4/9/9/2L6 b - 1'

        #先手番_香で利きを遮る場合(5)
        #sf.str_sfen = '4k4/9/1b7/9/9/2L1K4/9/9/9 b - 1'

        #先手番_香で利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/1b7/9/9/r1L1K4/9/9/9 b - 1'

        #先手番_香で利きを遮る場合(7)
        #sf.str_sfen = 'kr6K/9/9/9/6L2/9/9/9/9 b - 1'

        #先手番_香で利きを遮る場合(8)
        #sf.str_sfen = 'k8/9/r7K/9/9/6L2/9/9/9 b - 1'

        #先手番_桂で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/1b7/9/N8/4K4 b - 1'

        #先手番_桂で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/9/2N1K4 b - 1'

        #先手番_桂で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/9/r1N1K4 b - 1'

        #先手番_桂で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/r4K3/9/4N4 b - 1'

        #先手番_桂で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/1r4K2/9/4N4/9/9 b - 1'

        #先手番_桂で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/1r4K2/9/4N4/9/2b6 b - 1'

        #先手番_桂で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/1b7/9/9/4K4/2N6/9/9 b - 1'

        #先手番_桂で利きを遮る場合(5)
        #sf.str_sfen = '4k4/9/1b7/9/9/4K4/4N4/9/9 b - 1'

        #先手番_桂で利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/1b7/9/9/4K4/4N4/9/4r4 b - 1'

        #先手番_桂で利きを遮る場合(7)
        #sf.str_sfen = 'kr6K/9/7N1/9/9/9/9/9/9 b - 1'

        #先手番_桂で利きを遮る場合(8)
        #sf.str_sfen = 'k8/9/1r6K/9/8N/9/9/9/9 b - 1'

        #先手番_銀で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/2S6/4K4 b - 1'

        #先手番_銀で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/3S5/4K4 b - 1'

        #先手番_銀で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/1b7/3n5/3S5/4K4 b - 1'

        #先手番_銀で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/2S6/9/9 b - 1'

        #先手番_銀で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/3S5/9/9 b - 1'

        #先手番_銀で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/3S5/9/1b7 b - 1'

        #先手番_銀で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/9/1b1S5/9/9/4K4/9/9 b - 1'

        #先手番_銀で利きを遮る場合(5)
        #sf.str_sfen = '4k4/9/9/1b7/4S4/9/4K4/9/9 b - 1'

        #先手番_銀で利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/4r4/1b7/4S4/9/4K4/9/9 b - 1'

        #先手番_銀で利きを遮る場合(7)
        #sf.str_sfen = '4k4/9/1r5K1/5S3/9/9/9/9/9 b - 1'

        #先手番_銀で利きを遮る場合(8)
        #sf.str_sfen = '4k4/6S2/1r5K1/9/9/9/9/9/9 b - 1'

        #先手番_金で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/2G6/4K4 b - 1'

        #先手番_金で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/3G5/4K4 b - 1'

        #先手番_金で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/1b7/3n5/3G5/4K4 b - 1'

        #先手番_金で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/2G6/9/9 b - 1'

        #先手番_金で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/3G5/9/9 b - 1'

        #先手番_金で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/3G5/9/1b7 b - 1'

        #先手番_金で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/9/1b7/3G5/9/4K4/9/9 b - 1'

        #先手番_金で利きを遮る場合(5)
        #sf.str_sfen = '4k4/9/9/1b7/9/4G4/4K4/9/9 b - 1'

        #先手番_金で利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/4r4/1b7/9/4G4/4K4/9/9 b - 1'

        #先手番_とで駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/2+P6/4K4 b - 1'

        #先手番_とで駒を取る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/3+P5/4K4 b - 1'

        #先手番_とで駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/1b7/3n5/3+P5/4K4 b - 1'

        #先手番_とで利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/2+P6/9/9 b - 1'

        #先手番_とで利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/3+P5/9/9 b - 1'

        #先手番_とで利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/3+P5/9/1b7 b - 1'

        #先手番_とで利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/9/1b7/3+P5/9/4K4/9/9 b - 1'

        #先手番_とで利きを遮る場合(5)
        #sf.str_sfen = '4k4/9/9/1b7/9/4+P4/4K4/9/9 b - 1'

        #先手番_とで利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/4r4/1b7/9/4+P4/4K4/9/9 b - 1'

        #先手番_角で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/6B2/9/9/3n5/9/4K4 b - 1'

        #先手番_角で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/9/1B2K4 b - 1'

        #先手番_角で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/9/rB2K4 b - 1'

        #先手番_角で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/9/5B3 b - 1'

        #先手番_角で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/4B4/9 b - 1'

        #先手番_角で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/4B4/4r4 b - 1'

        #先手番_角で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/9/1b1B5/9/9/4K4/9/9 b - 1'

        #先手番_角で利きを遮る場合(5)
        #sf.str_sfen = '4k4/9/9/4B4/1b7/9/9/4K4/9 b - 1'

        #先手番_角で利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/4r4/4B4/1b7/9/9/4K4/9 b - 1'

        #先手番_角で利きを遮る場合(7)
        #sf.str_sfen = 'kr6K/9/9/8B/9/9/9/9/9 b - 1'

        #先手番_角で利きを遮る場合(8)
        #sf.str_sfen = '4k4/9/8B/9/r7K/9/9/9/9 b - 1'

        #先手番_飛で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/3R5/9/9/3n5/9/4K4 b - 1'

        #先手番_飛で駒を取る場合(2)
        #sf.str_sfen = '5k3/9/9/9/9/9/3nR4/9/4K4 b - 1'

        #先手番_飛で駒を取る場合(3)
        #sf.str_sfen = '5k3/9/9/4r4/9/9/3nR4/9/4K4 b - 1'

        #先手番_飛で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/9/2R6 b - 1'

        #先手番_飛で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/2R6/9 b - 1'

        #先手番_飛で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/2R6/1b7 b - 1'

        #先手番_飛で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/9/1b7/9/9/4K4/2R6/9 b - 1'

        #先手番_飛で利きを遮る場合(5)
        #sf.str_sfen = '5k3/9/9/9/1b7/4R4/9/4K4/9 b - 1'

        #先手番_飛で利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/4r4/9/1b7/4R4/9/4K4/9 b - 1'

        #先手番_飛で利きを遮る場合(7)
        #sf.str_sfen = 'kr6K/9/9/5R3/9/9/9/9/9 b - 1'

        #先手番_飛で利きを遮る場合(8)
        #sf.str_sfen = '4k4/9/6R2/9/r7K/9/9/9/9 b - 1'

        #先手番_馬で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/6+B2/9/9/3n5/9/4K4 b - 1'

        #先手番_馬で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/9/1+B2K4 b - 1'

        #先手番_馬で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/9/r+B2K4 b - 1'

        #先手番_馬で駒を取る場合(4)
        #sf.str_sfen = '4k4/9/9/9/9/3+B5/3n5/9/4K4 b - 1'

        #先手番_馬で駒を取る場合(5)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n+B4/9/4K4 b - 1'

        #先手番_馬で駒を取る場合(6)
        #sf.str_sfen = '4k4/9/9/4r4/9/9/3n+B4/9/4K4 b - 1'

        #先手番_馬で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/9/5+B3 b - 1'

        #先手番_馬で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/4+B4/9 b - 1'

        #先手番_馬で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/4+B4/4r4 b - 1'

        #先手番_馬で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/9/1b1+B5/9/9/4K4/9/9 b - 1'

        #先手番_馬で利きを遮る場合(5)
        #sf.str_sfen = '4k4/9/9/4+B4/1b7/9/9/4K4/9 b - 1'

        #先手番_馬で利きを遮る場合(6)
        #sf.str_sfen = '4k4/9/4r4/4+B4/1b7/9/9/4K4/9 b - 1'

        #先手番_馬で利きを遮る場合(7)
        #sf.str_sfen = '4k4/9/9/9/2+B6/r3K4/9/9/9 b - 1'

        #先手番_馬で利きを遮る場合(8)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/3+B5/9/9 b - 1'

        #先手番_馬で利きを遮る場合(9)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/3+B5/9/1b7 b - 1'

        #先手番_馬で利きを遮る場合(10)
        #sf.str_sfen = '4k4/9/9/1b7/9/2+B6/4K4/9/9 b - 1'

        #先手番_馬で利きを遮る場合(11)
        #sf.str_sfen = '4k4/9/9/9/1b7/9/4+B4/4K4/9 b - 1'

        #先手番_馬で利きを遮る場合(12)
        #sf.str_sfen = '4k4/9/4r4/9/1b7/9/4+B4/4K4/9 b - 1'

        #先手番_龍で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/9/3+R5/9/9/3n5/9/4K4 b - 1'

        #先手番_龍で駒を取る場合(2)
        #sf.str_sfen = '5k3/9/9/9/9/9/3n+R4/9/4K4 b - 1'

        #先手番_龍で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/9/4r4/9/9/3n+R4/9/4K4 b - 1'

        #先手番_龍で駒を取る場合(4)
        #sf.str_sfen = '4k4/9/9/9/9/9/3n5/2+R6/4K4 b - 1'

        #先手番_龍で駒を取る場合(5)
        #sf.str_sfen = '4k4/9/9/9/9/4+R4/3n5/9/4K4 b - 1'

        #先手番_龍で駒を取る場合(6)
        #sf.str_sfen = '4k4/9/4r4/9/9/4+R4/3n5/9/4K4 b - 1'

        #先手番_龍で利きを遮る場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/9/2+R6 b - 1'

        #先手番_龍で利きを遮る場合(2)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/2+R6/9 b - 1'

        #先手番_龍で利きを遮る場合(3)
        #sf.str_sfen = '4k4/9/9/9/9/r3K4/9/2+R6/1b7 b - 1'

        #先手番_龍で利きを遮る場合(4)
        #sf.str_sfen = '4k4/9/9/1b7/9/9/4K4/2+R6/9 b - 1'

        #先手番_龍で利きを遮る場合(5)
        #sf.str_sfen = '3k5/9/9/b8/4+R4/9/9/4K4/9 b - 1'

        #先手番_龍で利きを遮る場合(6)
        #sf.str_sfen = '3k5/4r4/9/b8/4+R4/9/9/4K4/9 b - 1'

        #先手番_龍で利きを遮る場合(7)
        #sf.str_sfen = '4k4/9/9/9/9/r4K3/3+R5/9/9 b - 1'

        #先手番_龍で利きを遮る場合(8)
        #sf.str_sfen = '4k4/9/9/9/5+R3/r4K3/9/9/9 b - 1'

        #先手番_龍で利きを遮る場合(9)
        #sf.str_sfen = '4kl3/9/9/9/5+R3/r4K3/9/9/9 b - 1'

        #先手番_龍で利きを遮る場合(10)
        #sf.str_sfen = '4k4/9/9/1b7/9/9/4K4/2+R6/9 b - 1'

        #先手番_龍で利きを遮る場合(11)
        #sf.str_sfen = '5k3/9/9/9/1b7/4+R4/8/4K4/9 b - 1'

        #先手番_龍で利きを遮る場合(12)
        #sf.str_sfen = '4k4/9/4r4/9/1b7/4+R4/9/4K4/9 b - 1'

        #先手番_歩の合駒の場合(1)
        #sf.str_sfen = '4k4/4r4/9/9/9/9/9/9/4K4 b P 1'

        #先手番_歩の合駒の場合(2)
        #sf.str_sfen = '4k4/9/9/9/r7K/9/1P1P1P1P1/9/9 b P 1'

        #先手番_歩の合駒の場合(3)
        #sf.str_sfen = 'kr6K/9/9/9/9/9/9/9/9 b P 1'

        #先手番_歩の合駒の場合(4)
        #sf.str_sfen = 'b3k4/9/9/9/9/9/9/9/1P1P1P1PK b P 1'

        #先手番_歩の合駒の場合(5)
        #sf.str_sfen = '4k3b/9/9/9/9/9/9/9/KP1P1P1P1 b P 1'

        #先手番_香の合駒の場合(1)
        #sf.str_sfen = '4k4/4r4/9/9/9/9/9/9/4K4 b L 1'

        #先手番_香の合駒の場合(2)
        #sf.str_sfen = '4k4/9/9/9/r7K/9/9/9/9 b L 1'

        #先手番_香の合駒の場合(3)
        #sf.str_sfen = 'kr6K/9/9/9/9/9/9/9/9 b L 1'

        #先手番_香の合駒の場合(4)
        #sf.str_sfen = 'b3k4/9/9/9/9/9/9/9/8K b L 1'

        #先手番_香の合駒の場合(5)
        #sf.str_sfen = '4k3b/9/9/9/9/9/9/9/K8 b L 1'

        #先手番_桂の合駒の場合(1)
        #sf.str_sfen = '4k4/4r4/9/9/9/9/9/9/4K4 b N 1'

        #先手番_桂の合駒の場合(2)
        #sf.str_sfen = '4k4/9/9/9/r7K/9/9/9/9 b N 1'

        #先手番_桂の合駒の場合(3)
        #sf.str_sfen = 'kr6K/9/9/9/9/9/9/9/9 b N 1'

        #先手番_桂の合駒の場合(4)
        #sf.str_sfen = '9/kr6K/9/9/9/9/9/9/9 b N 1'

        #先手番_桂の合駒の場合(5)
        #sf.str_sfen = 'b3k4/9/9/9/9/9/9/9/8K b N 1'

        #先手番_桂の合駒の場合(6)
        #sf.str_sfen = '4k3b/9/9/9/9/9/9/9/K8 b N 1'

        #先手番_銀の合駒の場合(1)
        #sf.str_sfen = '4k4/4r4/9/9/9/9/9/9/4K4 b S 1'

        #先手番_銀の合駒の場合(2)
        #sf.str_sfen = '4k4/9/9/9/r7K/9/9/9/9 b S 1'

        #先手番_銀の合駒の場合(3)
        #sf.str_sfen = 'b3k4/9/9/9/9/9/9/9/8K b S 1'

        #先手番_銀の合駒の場合(4)
        #sf.str_sfen = '4k3b/9/9/9/9/9/9/9/K8 b S 1'

        #先手番_金の合駒の場合(1)
        #sf.str_sfen = '4k4/4r4/9/9/9/9/9/9/4K4 b G 1'

        #先手番_金の合駒の場合(2)
        #sf.str_sfen = '4k4/9/9/9/r7K/9/9/9/9 b G 1'

        #先手番_金の合駒の場合(3)
        #sf.str_sfen = 'b3k4/9/9/9/9/9/9/9/8K b G 1'

        #先手番_金の合駒の場合(4)
        #sf.str_sfen = '4k3b/9/9/9/9/9/9/9/K8 b G 1'

        #先手番_角の合駒の場合(1)
        #sf.str_sfen = '4k4/4r4/9/9/9/9/9/9/4K4 b B 1'

        #先手番_角の合駒の場合(2)
        #sf.str_sfen = '4k4/9/9/9/r7K/9/9/9/9 b B 1'

        #先手番_角の合駒の場合(3)
        #sf.str_sfen = 'b3k4/9/9/9/9/9/9/9/8K b B 1'

        #先手番_角の合駒の場合(4)
        #sf.str_sfen = '4k3b/9/9/9/9/9/9/9/K8 b B 1'

        #先手番_飛の合駒の場合(1)
        #sf.str_sfen = '4k4/4r4/9/9/9/9/9/9/4K4 b R 1'

        #先手番_飛の合駒の場合(2)
        #sf.str_sfen = '4k4/9/9/9/r7K/9/9/9/9 b R 1'

        #先手番_飛の合駒の場合(3)
        #sf.str_sfen = 'b3k4/9/9/9/9/9/9/9/8K b R 1'

        #先手番_飛の合駒の場合(4)
        #sf.str_sfen = '4k3b/9/9/9/9/9/9/9/K8 b R 1'

        #後手番_玉が逃げる手
        #sf.str_sfen = '5s3/3Sk4/3p1p3/9/4R4/9/9/9/4K4 w - 1'

        #後手番_玉で取る手
        #sf.str_sfen = '3skn3/3pp+P3/9/9/9/9/9/9/4K4 w - 1'

        #後手番_両王手の場合(1)
        #sf.str_sfen = '3nk4/3p1S3/9/9/4R4/9/9/9/4K4 w - 1'

        #後手番_両王手の場合(2)
        #sf.str_sfen = '4kn3/3p5/6B2/9/4R4/9/9/9/4K4 w - 1'

        #後手番_歩で駒を取る場合(1)
        #sf.str_sfen = '4k4/6p2/6B2/9/9/9/9/9/4K4 w - 1'

        #後手番_歩で駒を取る場合(2)
        #sf.str_sfen = '4k4/5p3/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_歩で駒を取る場合(3)
        #sf.str_sfen = '4k4/5p3/5NB2/9/9/9/9/9/4K4 w - 1'

        #後手番_歩で駒を取る場合(4)
        #sf.str_sfen = '9/9/9/9/1k7/p8/N8/9/4K4 w - 1'

        #後手番_歩で利きを遮る場合(1)
        #sf.str_sfen = '5p3/3k3R1/9/9/9/9/9/9/4K4 w - 1'

        #後手番_歩で利きを遮る場合(2)
        #sf.str_sfen = '9/5p3/4k2R1/9/9/9/9/9/4K4 w - 1'

        #後手番_歩で利きを遮る場合(3)
        #sf.str_sfen = '6B2/5p3/4k2R1/9/9/9/9/9/4K4 w - 1'

        #後手番_歩で利きを遮る場合(4)
        #sf.str_sfen = '9/9/4k4/6p2/9/7B1/9/9/4K4 w - 1'

        #後手番_歩で利きを遮る場合(5)
        #sf.str_sfen = '9/9/4kp3/9/9/7B1/9/9/4K4 w - 1'

        #後手番_歩で利きを遮る場合(6)
        #sf.str_sfen = '9/9/4kp1R1/9/9/7B1/9/9/4K4 w - 1'

        #後手番_歩で利きを遮る場合(7)
        #sf.str_sfen = '9/9/9/9/9/9/9/4p4/KR6k w - 1'

        #後手番_香で駒を取る場合(1)
        #sf.str_sfen = '4k4/7l1/9/7B1/9/9/9/9/4K4 w - 1'

        #後手番_香で駒を取る場合(2)
        #sf.str_sfen = '4k2l1/9/9/7B1/9/9/9/9/4K4 w - 1'

        #後手番_香で駒を取る場合(3)
        #sf.str_sfen = '4k2lR/9/9/7B1/9/9/9/9/4K4 w - 1'

        #後手番_香で利きを遮る場合(1)
        #sf.str_sfen = '6l2/9/9/4k2R1/9/9/9/9/4K4 w - 1'

        #後手番_香で利きを遮る場合(2)
        #sf.str_sfen = '9/6l2/9/4k2R1/9/9/9/9/4K4 w - 1'

        #後手番_香で利きを遮る場合(3)
        #sf.str_sfen = '7B1/6l2/9/4k2R1/9/9/9/9/4K4 w - 1'

        #後手番_香で利きを遮る場合(4)
        #sf.str_sfen = '6l2/9/9/4k4/9/9/7B1/9/4K4 w - 1'

        #後手番_香で利きを遮る場合(5)
        #sf.str_sfen = '9/9/9/4k1l2/9/9/7B1/9/4K4 w - 1'

        #後手番_香で利きを遮る場合(6)
        #sf.str_sfen = '9/9/9/4k1l1R/9/9/7B1/9/4K4 w - 1'

        #後手番_香で利きを遮る場合(7)
        #sf.str_sfen = '9/9/9/9/2l6/9/9/9/k6RK w - 1'

        #後手番_香で利きを遮る場合(8)
        #sf.str_sfen = '9/9/9/2l6/9/9/k7R/9/8K w - 1'

        #後手番_桂で駒を取る場合(1)
        #sf.str_sfen = '4k4/8n/9/7B1/9/9/9/9/4K4 w - 1'

        #後手番_桂で駒を取る場合(2)
        #sf.str_sfen = '4k1n2/9/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_桂で駒を取る場合(3)
        #sf.str_sfen = '4k1n1R/9/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_桂で利きを遮る場合(1)
        #sf.str_sfen = '4n4/9/3k4R/9/9/9/9/9/4K4 w - 1'

        #後手番_桂で利きを遮る場合(2)
        #sf.str_sfen = '9/9/4n4/9/2k4R1/9/9/9/4K4 w - 1'

        #後手番_桂で利きを遮る場合(3)
        #sf.str_sfen = '6B2/9/4n4/9/2k4R1/9/9/9/4K4 w - 1'

        #後手番_桂で利きを遮る場合(4)
        #sf.str_sfen = '9/9/6n2/4k4/9/9/7B1/9/4K4 w - 1'

        #後手番_桂で利きを遮る場合(5)
        #sf.str_sfen = '9/9/4n4/4k4/9/9/7B1/9/4K4 w - 1'

        #後手番_桂で利きを遮る場合(6)
        #sf.str_sfen = '4R4/9/4n4/4k4/9/9/7B1/9/4K4 w - 1'

        #後手番_桂で利きを遮る場合(7)
        #sf.str_sfen = '9/9/9/9/9/9/1n7/9/k6RK w - 1'

        #後手番_桂で利きを遮る場合(8)
        #sf.str_sfen = '9/9/9/9/n8/9/k6R1/9/8K w - 1'

        #後手番_銀で駒を取る場合(1)
        #sf.str_sfen = '4k4/6s2/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_銀で駒を取る場合(2)
        #sf.str_sfen = '4k4/5s3/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_銀で駒を取る場合(3)
        #sf.str_sfen = '4k4/5s3/5N3/7B1/9/9/9/9/4K4 w - 1'

        #後手番_銀で利きを遮る場合(1)
        #sf.str_sfen = '9/9/6s2/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_銀で利きを遮る場合(2)
        #sf.str_sfen = '9/9/5s3/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_銀で利きを遮る場合(3)
        #sf.str_sfen = '7B1/9/5s3/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_銀で利きを遮る場合(4)
        #sf.str_sfen = '9/9/4k4/9/9/5s1B1/9/9/4K4 w - 1'

        #後手番_銀で利きを遮る場合(5)
        #sf.str_sfen = '9/9/4k4/9/4s4/7B1/9/9/4K4 w - 1'

        #後手番_銀で利きを遮る場合(6)
        #sf.str_sfen = '9/9/4k4/9/4s4/7B1/4R4/9/4K4 w - 1'

        #後手番_銀で利きを遮る場合(7)
        #sf.str_sfen = '9/9/9/9/9/3s5/1k5R1/9/4K4 w - 1'

        #後手番_銀で利きを遮る場合(8)
        #sf.str_sfen = '9/9/9/9/9/9/1k5R1/2s6/4K4 w - 1'

        #後手番_金で駒を取る場合(1)
        #sf.str_sfen = '4k4/6g2/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_金で駒を取る場合(2)
        #sf.str_sfen = '4k4/5g3/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_金で駒を取る場合(3)
        #sf.str_sfen = '4k4/5g3/5N3/7B1/9/9/9/9/4K4 w - 1'

        #後手番_金で利きを遮る場合(1)
        #sf.str_sfen = '9/9/6g2/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_金で利きを遮る場合(2)
        #sf.str_sfen = '9/9/5g3/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_金で利きを遮る場合(3)
        #sf.str_sfen = '7B1/9/5g3/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_金で利きを遮る場合(4)
        #sf.str_sfen = '9/9/4k4/9/5g3/7B1/9/9/4K4 w - 1'

        #後手番_金で利きを遮る場合(5)
        #sf.str_sfen = '9/9/4k4/4g4/9/7B1/9/9/4K4 w - 1'

        #後手番_金で利きを遮る場合(6)
        #sf.str_sfen = '9/9/4k4/4g4/9/7B1/4R4/9/4K4 w - 1'

        #後手番_とで駒を取る場合(1)
        #sf.str_sfen = '4k4/6+p2/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_とで駒を取る場合(2)
        #sf.str_sfen = '4k4/5+p3/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_とで駒を取る場合(3)
        #sf.str_sfen = '4k4/5+p3/5N3/7B1/9/9/9/9/4K4 w - 1'

        #後手番_とで利きを遮る場合(1)
        #sf.str_sfen = '9/9/6+p2/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_とで利きを遮る場合(2)
        #sf.str_sfen = '9/9/5+p3/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_とで利きを遮る場合(3)
        #sf.str_sfen = '7B1/9/5+p3/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_とで利きを遮る場合(4)
        #sf.str_sfen = '9/9/4k4/9/5+p3/7B1/9/9/4K4 w - 1'

        #後手番_とで利きを遮る場合(5)
        #sf.str_sfen = '9/9/4k4/4+p4/9/7B1/9/9/4K4 w - 1'

        #後手番_とで利きを遮る場合(6)
        #sf.str_sfen = '9/9/4k4/4+p4/9/7B1/4R4/9/4K4 w - 1'

        #後手番_角で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/5N3/9/9/2b6/9/9/4K4 w - 1'

        #後手番_角で駒を取る場合(2)
        #sf.str_sfen = '4k2b1/9/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_角で駒を取る場合(3)
        #sf.str_sfen = '4k2bR/9/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_角で利きを遮る場合(1)
        #sf.str_sfen = '3b5/9/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_角で利きを遮る場合(2)
        #sf.str_sfen = '9/4b4/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_角で利きを遮る場合(3)
        #sf.str_sfen = '4R4/4b4/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_角で利きを遮る場合(4)
        #sf.str_sfen = '9/9/4k4/9/9/5b1B1/9/9/4K4 w - 1'

        #後手番_角で利きを遮る場合(5)
        #sf.str_sfen = '9/4k4/9/9/7B1/4b4/9/9/4K4 w - 1'

        #後手番_角で利きを遮る場合(6)
        #sf.str_sfen = '9/4k4/9/9/7B1/4b4/4R4/9/4K4 w - 1'

        #後手番_角で利きを遮る場合(7)
        #sf.str_sfen = '9/9/9/9/9/b8/9/9/k6RK w - 1'

        #後手番_角で利きを遮る場合(8)
        #sf.str_sfen = '9/9/9/9/k7R/9/b8/9/4K4 w - 1'

        #後手番_飛で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/5N3/9/9/5r3/9/9/4K4 w - 1'

        #後手番_飛で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/4rN3/9/9/9/9/9/4K4 w - 1'

        #後手番_飛で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/4rN3/9/9/4R4/9/9/4K4 w - 1'

        #後手番_飛で利きを遮る場合(1)
        #sf.str_sfen = '6r2/9/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_飛で利きを遮る場合(2)
        #sf.str_sfen = '9/6r2/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_飛で利きを遮る場合(3)
        #sf.str_sfen = '7B1/6r2/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_飛で利きを遮る場合(4)
        #sf.str_sfen = '9/6r2/4k4/9/9/7B1/9/9/4K4 w - 1'

        #後手番_飛で利きを遮る場合(5)
        #sf.str_sfen = '9/4k4/9/4r4/7B1/9/9/9/3K5 w - 1'

        #後手番_飛で利きを遮る場合(6)
        #sf.str_sfen = '9/4k4/9/4r4/7B1/9/4R4/9/4K4 w - 1'

        #後手番_飛で利きを遮る場合(7)
        #sf.str_sfen = '9/9/9/9/9/5r3/9/9/KR6k w - 1'

        #後手番_飛で利きを遮る場合(8)
        #sf.str_sfen = '9/9/9/9/k7R/9/2r6/9/4K4 w - 1'

        #後手番_馬で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/5N3/9/9/2+b6/9/9/4K4 w - 1'

        #後手番_馬で駒を取る場合(2)
        #sf.str_sfen = '4k2+b1/9/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_馬で駒を取る場合(3)
        #sf.str_sfen = '4k2+bR/9/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_馬で駒を取る場合(4)
        #sf.str_sfen = '4k4/9/5N3/5+b3/9/9/9/9/4K4 w - 1'

        #後手番_馬で駒を取る場合(5)
        #sf.str_sfen = '4k4/9/4+bN3/9/9/9/9/9/4K4 w - 1'

        #後手番_馬で駒を取る場合(6)
        #sf.str_sfen = '4k4/9/4+bN3/9/9/4R4/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(1)
        #sf.str_sfen = '3+b5/9/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(2)
        #sf.str_sfen = '9/4+b4/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(3)
        #sf.str_sfen = '4R4/4+b4/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(4)
        #sf.str_sfen = '9/9/4k4/9/9/5+b1B1/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(5)
        #sf.str_sfen = '9/4k4/9/9/7B1/4+b4/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(6)
        #sf.str_sfen = '9/4k4/9/9/7B1/4+b4/4R4/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(7)
        #sf.str_sfen = '9/9/9/4k3R/6+b29/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(8)
        #sf.str_sfen = '9/9/5+b3/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(9)
        #sf.str_sfen = '7B1/9/5+b3/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(10)
        #sf.str_sfen = '9/9/4k4/6+b2/9/7B1/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(11)
        #sf.str_sfen = '9/4k4/4+b4/9/7B1/9/9/9/4K4 w - 1'

        #後手番_馬で利きを遮る場合(12)
        #sf.str_sfen = '9/4k4/4+b4/9/7B1/9/4R4/9/4K4 w - 1'

        #後手番_龍で駒を取る場合(1)
        #sf.str_sfen = '4k4/9/5N3/9/9/5+r3/9/9/4K4 w - 1'

        #後手番_龍で駒を取る場合(2)
        #sf.str_sfen = '4k4/9/4+rN3/9/9/9/9/9/3K5 w - 1'

        #後手番_龍で駒を取る場合(3)
        #sf.str_sfen = '4k4/9/4+rN3/9/9/4R4/9/9/3K5 w - 1'

        #後手番_龍で駒を取る場合(4)
        #sf.str_sfen = '4k4/6+r2/5N3/9/9/9/9/9/4K4 w - 1'

        #後手番_龍で駒を取る場合(5)
        #sf.str_sfen = '4k4/9/5N3/4+r4/9/9/9/9/3K5 w - 1'

        #後手番_龍で駒を取る場合(6)
        #sf.str_sfen = '4k4/9/5N3/4+r4/9/9/4R4/9/4K4 w - 1'

        #後手番_龍で利きを遮る場合(1)
        #sf.str_sfen = '6+r2/9/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_龍で利きを遮る場合(2)
        #sf.str_sfen = '9/6+r2/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_龍で利きを遮る場合(3)
        #sf.str_sfen = '7B1/6+r2/9/4k3R/9/9/9/9/4K4 w - 1'

        #後手番_龍で利きを遮る場合(4)
        #sf.str_sfen = '9/6+r2/4k4/9/9/7B1/9/9/4K4 w - 1'

        #後手番_龍で利きを遮る場合(5)
        #sf.str_sfen = '9/4k4/9/9/4+r4/8B/9/9/5K3 w - 1'

        #後手番_龍で利きを遮る場合(6)
        #sf.str_sfen = '9/4k4/9/9/4+r4/8B/9/4R4/5K3 w - 1'

        #後手番_龍で利きを遮る場合(7)
        #sf.str_sfen = '9/9/5+r3/3k4R/9/9/9/9/4K4 w - 1'

        #後手番_龍で利きを遮る場合(8)
        #sf.str_sfen = '9/9/9/3k4R/3+r5/9/9/9/4K4 w - 1'

        #後手番_龍で利きを遮る場合(9)
        #sf.str_sfen = '9/9/9/3k4R/3+r5/9/9/9/3LK4 w - 1'

        #後手番_龍で利きを遮る場合(10)
        #sf.str_sfen = '9/6+r2/4k4/9/9/7B1/9/9/4K4 w - 1'

        #後手番_龍で利きを遮る場合(11)
        #sf.str_sfen = '9/4k4/9/4+r4/7B1/9/9/9/3K5 w - 1'

        #後手番_龍で利きを遮る場合(12)
        #sf.str_sfen = '9/4k4/9/4+r4/7B1/9/4R4/9/4K4 w - 1'

        #後手番_歩の合駒の場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/4R4/4K4 w p 1'

        #後手番_歩の合駒の場合(2)
        #sf.str_sfen = '9/9/1p1p1p1p1/9/k7R/9/9/9/4K4 w p 1'

        #後手番_歩の合駒の場合(3)
        #sf.str_sfen = '9/9/9/9/9/9/9/9/k6RK w p 1'

        #後手番_歩の合駒の場合(4)
        #sf.str_sfen = 'kp1p1p1p1/9/9/9/9/9/9/9/4K3B w p 1'

        #後手番_歩の合駒の場合(5)
        #sf.str_sfen = '1p1p1p1pk/9/9/9/9/9/9/9/B3K4 w p 1'

        #後手番_香の合駒の場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/4R4/4K4 w l 1'

        #後手番_香の合駒の場合(2)
        #sf.str_sfen = '9/9/9/9/k7R/9/9/9/4K4 w l 1'

        #後手番_香の合駒の場合(3)
        #sf.str_sfen = '9/9/9/9/9/9/9/9/k6RK w l 1'

        #後手番_香の合駒の場合(4)
        #sf.str_sfen = 'k8/9/9/9/9/9/9/9/4K3B w l 1'

        #後手番_香の合駒の場合(5)
        #sf.str_sfen = '8k/9/9/9/9/9/9/9/B3K4 w l 1'

        #後手番_桂の合駒の場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/4R4/4K4 w n 1'

        #後手番_桂の合駒の場合(2)
        #sf.str_sfen = '9/9/9/9/k7R/9/9/9/4K4 w n 1'

        #後手番_桂の合駒の場合(3)
        #sf.str_sfen = '9/9/9/9/9/9/9/9/k6RK w n 1'

        #後手番_桂の合駒の場合(4)
        #sf.str_sfen = '9/9/9/9/9/9/9/k6RK/9 w n 1'

        #後手番_桂の合駒の場合(5)
        #sf.str_sfen = 'k8/9/9/9/9/9/9/9/4K3B w n 1'

        #後手番_桂の合駒の場合(6)
        sf.str_sfen = '8k/9/9/9/9/9/9/9/B3K4 w n 1'

        #後手番_銀の合駒の場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/4R4/4K4 w s 1'

        #後手番_銀の合駒の場合(2)
        #sf.str_sfen = '9/9/9/9/k7R/9/9/9/4K4 w s 1'

        #後手番_銀の合駒の場合(3)
        #sf.str_sfen = 'k8/9/9/9/9/9/9/9/4K3B w s 1'

        #後手番_銀の合駒の場合(4)
        #sf.str_sfen = '8k/9/9/9/9/9/9/9/B3K4 w s 1'

        #後手番_金の合駒の場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/4R4/4K4 w g 1'

        #後手番_金の合駒の場合(2)
        #sf.str_sfen = '9/9/9/9/k7R/9/9/9/4K4 w g 1'

        #後手番_金の合駒の場合(3)
        #sf.str_sfen = 'k8/9/9/9/9/9/9/9/4K3B w g 1'

        #後手番_金の合駒の場合(4)
        #sf.str_sfen = '8k/9/9/9/9/9/9/9/B3K4 w g 1'

        #後手番_角の合駒の場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/4R4/4K4 w b 1'

        #後手番_角の合駒の場合(2)
        #sf.str_sfen = '9/9/9/9/k7R/9/9/9/4K4 w b 1'

        #後手番_角の合駒の場合(3)
        #sf.str_sfen = 'k8/9/9/9/9/9/9/9/4K3B w b 1'

        #後手番_角の合駒の場合(4)
        #sf.str_sfen = '8k/9/9/9/9/9/9/9/B3K4 w b 1'

        #後手番_飛の合駒の場合(1)
        #sf.str_sfen = '4k4/9/9/9/9/9/9/4R4/4K4 w r 1'

        #後手番_飛の合駒の場合(2)
        #sf.str_sfen = '9/9/9/9/k7R/9/9/9/4K4 w r 1'

        #後手番_飛の合駒の場合(3)
        #sf.str_sfen = 'k8/9/9/9/9/9/9/9/4K3B w r 1'

        #後手番_飛の合駒の場合(4)
        #sf.str_sfen = '8k/9/9/9/9/9/9/9/B3K4 w r 1'

        sf.parse_fen()
        moves = []
        if bo.color == co.black:
            cls_evasion.b_gen_evasion(moves)
        else:
            cls_evasion.w_gen_evasion(moves)

        for i in range(len(moves)):
            if moves[i].piece_to_move == 7:
                print("hit")

        x = 0